#include "GetData.h"
#include <iostream>

void CGetData::GetAnswer(const char* szMessage, const char* szError, int& nNumber,
    int nMin, int nMax)
{
    std::cout << szMessage;
    while (!(std::cin >> nNumber) || !(nNumber >= nMin && nNumber <= nMax))
    {
        std::cin.clear();
        std::cin.ignore(32767, '\n');
        std::cout << szError;
    }
}

void CGetData::GetData(std::vector<CData>& arrData)
{
    int nCount = 0;

    arrData.clear();

    std::cout << "Анкета для випускників бакалаврів 122 спеціальності кафедри Комп'ютерних\nнаук та інформаційних технологій."
        << " Анкетування анонімне.\n\nПросимо Вас дати відповіді на поставлені запитання. "
        << "Там, де запропоновані\nваріанти відповідей, оберіть номер відповіді, яка сходиться з Вашою думкою.\n"
        << "Висловлені Вами побажання будуть використані для удосконалення системи \nзабезпечення якості освіти"
        << " в Дніпровському національному університеті\nімені Олеся Гончара. \n\nДякуємо за співпрацю!\n";

    GetAnswer("\nБудь ласка, введіть кількість людей, яка проходить опитування: ",
        "\nНекоректне введення. Будь ласка, введіть додатнє ціле число: ",
        nCount, 1);
    arrData.resize(nCount);
    for (int i = 0; i < nCount; i++)
    {
        CData& data = arrData[i];
        std::cout << "\n___________________________________________________________________________";
        std::cout << "\nОпитування для " << i + 1 << "-ої " << "людини:\n";

        GetAnswer("\nБудь ласка, оберіть ступінь знайомства з проблемою змістового наповнення\nосвітньої програми за десятибальною шкалою, де:\n\n"
            "0 балів - не знайомий із проблемою;\n"
            "1-3 бали - погано знайомий, але проблема входить до кола інтересів;\n"
            "4-6 балів - задовільно знайомий, але практично не займається;\n"
            "7-9 балів - добре знайомий і займається практично;\n"
            "10 балів - вузький фахівець із проблеми.\n\nВаша відповідь: ",
            "\nНекоректне введення. Будь ласка, введіть ціле число в діапазоні від 0 до 10: ",
            data.m_nKnowProblem, 0, 10);

        GetAnswer("\nБудь ласка, оцініть Вашу обізнаність у наступних джерелах\nзнань (навчальний досвід, досвід практичної роботи, вимоги" 
            " ринку праці,\nінтуїція) за трьохбальною шкалою, де:\n\n"
            "1 - високий;\n"
            "2 - низький;\n"
            "3 - середній.\n\n"
            "Навчальний досвід\n\n"
            "Ваша відповідь: ",
            "\nНекоректне введення. Будь ласка, введіть 1, 2 або 3: ",
            data.m_nEducationalExperience, 1, 3);

        GetAnswer("\nДосвід практичної роботи\n\n"
            "Ваша відповідь: ",
            "\nНекоректне введення. Будь ласка, введіть 1, 2 або 3: ",
            data.m_nPracticalExperience, 1, 3);

        GetAnswer("\nВимоги ринку праці\n\n"
            "Ваша відповідь: ",
            "\nНекоректне введення. Будь ласка, введіть 1, 2 або 3: ",
            data.m_nLaborMarketRequirements, 1, 3);

        GetAnswer("\nІнтуїція\n\n"
            "Ваша відповідь: ",
            "\nНекоректне введення. Будь ласка, введіть 1, 2 або 3: ",
            data.m_nIntuition, 1, 3);

        GetAnswer("\nОцініть, будь ласка, необхідність ввести додаткові години для наведених\nнижче дисциплін,"
            " використовуючи п'ятибальну шкалу, де:\n\n"
            "1 - ні;\n"
            "2 - скоріше ні;\n"
            "3 - рівною мірою так і ні;\n"
            "4 - скоріше так;\n"
            "5 - так.\n"
            "\n1. Вивчення іноземної мови.\n\n"
            "Ваша відповідь: ",
            "\nНекоректне введення. Будь ласка, введіть число від 1 до 5: ",
            data.m_arrSubject[Subjects::english], 1, 5);

        GetAnswer("\n2. Програмування мовою C++.\n\n"
            "Ваша відповідь: ",
            "\nНекоректне введення. Будь ласка, введіть число від 1 до 5: ",
            data.m_arrSubject[Subjects::languageCC], 1, 5);

        GetAnswer("\n3. Програмування мовою Java.\n\n"
            "Ваша відповідь: ",
            "\nНекоректне введення. Будь ласка, введіть число від 1 до 5: ",
            data.m_arrSubject[Subjects::languageJava], 1, 5);

        GetAnswer("\n4. Програмування мовою C#.\n\n"
            "Ваша відповідь: ",
            "\nНекоректне введення. Будь ласка, введіть число від 1 до 5: ",
            data.m_arrSubject[Subjects::languageC], 1, 5);

        GetAnswer("\n5. Програмування мовою Python.\n\n"
            "Ваша відповідь: ",
            "\nНекоректне введення. Будь ласка, введіть число від 1 до 5: ",
            data.m_arrSubject[Subjects::languagePy], 1, 5);

        GetAnswer("\n6. Веб-програмування.\n\n"
            "Ваша відповідь: ",
            "\nНекоректне введення. Будь ласка, введіть число від 1 до 5: ",
            data.m_arrSubject[Subjects::web], 1, 5);

        GetAnswer("\n7. Тестування програмного забезпечення.\n\n"
            "Ваша відповідь: ",
            "\nНекоректне введення. Будь ласка, введіть число від 1 до 5: ",
            data.m_arrSubject[Subjects::qa], 1, 5);

        GetAnswer("\n8. Кібербезпека.\n\n"
            "Ваша відповідь: ",
            "\nНекоректне введення. Будь ласка, введіть число від 1 до 5: ",
            data.m_arrSubject[Subjects::cybersecurity], 1, 5);

        GetAnswer("\n9. Штучний інтелект та нейронні мережі.\n\n"
            "Ваша відповідь: ",
            "\nНекоректне введення. Будь ласка, введіть число від 1 до 5: ",
            data.m_arrSubject[Subjects::artificialIntelligence], 1, 5);

        GetAnswer("\n10. Програмування для мобільних платформ.\n\n"
            "Ваша відповідь: ",
            "\nНекоректне введення. Будь ласка, введіть число від 1 до 5: ",
            data.m_arrSubject[Subjects::progForMob], 1, 5);

        std::cout << "\n\nДякую за Вашу відповідь!\n";
    }
}
